In [1]:
#Descriptive Statistics
#In measures of central tendancy
#mean,median & mode

# Measures of Central Tendency

In [2]:
import pandas as pd
data=pd.read_excel('Assignment 1 -18.04.2023.xlsx')
data

,Measures of Central Tendency and Measures of Dispersion,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,NaN,Example 1,Example 2,Example 3,Example 4,Example 5,Example 6,Example 7,Example 8
1,NaN,1,1,1,1,1,1,2,2
2,NaN,1,1,1,2,2,1,2,2
3,NaN,2,2,2,2,2,2,2,2
4,NaN,2,2,2,3,3,2,2,2
5,NaN,3,3,3,4,4,4,2,2
6,NaN,3,3,3,5,5,NaN,NaN,10000
7,NaN,4,4,4,6,6,NaN,NaN,NaN
8,NaN,5,5,5,6,6,NaN,NaN,NaN
9,NaN,5,5,5,6,6,NaN,NaN,NaN
10,NaN,6,6,6,7,7,NaN,NaN,NaN
11,NaN,NaN,100,100,8,8,NaN,NaN,NaN
12,NaN,NaN,NaN,112,100,100,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,200,200,NaN,NaN,NaN
14,NaN,NaN,NaN,NaN,NaN,5000,NaN,NaN,NaN
15,Mean,3.2,12,20.333333,26.923077,382.142857,2,2,1668.333333
16,Median,3,3,3.5,6,6,2,2,2
17,Mode,1,1,1,6,6,1,2,2
18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,variance,3.066667,854.6,1610.242424,3404.74359,1769678.131868,1.5,0,16660000.666667
20,standard Deviation,1.75119,29.233542,40.127826,58.350181,1330.292499,1.224745,0,4081.666408

In [3]:
#mean
import numpy as np
x=[1,1,2,2,3,3,4,5,5,6]
#using numpy 
np.mean(x)

3.2

In [4]:
#created the list in to a table format
import pandas as pd
z=pd.DataFrame(data={'values':[1,1,2,2,3,3,4,5,5,6]})
z

   values
0       1
1       1
2       2
3       2
4       3
5       3
6       4
7       5
8       5
9       6

In [5]:
#median
x=[1,1,2,2,3,3,4,5,5,6]
#using numpy
np.median(x)

3.0

In [6]:
print("median: ",np.median(x))

median:  3.0

In [7]:
z.describe()

         values
count  10.00000
mean    3.20000
std     1.75119
min     1.00000
25%     2.00000
50%     3.00000
75%     4.75000
max     6.00000

In [ ]:
#mode
#numpy does not has an attribute mode

In [8]:
#using pandas
z.mode()

   values
0       1
1       2
2       3
3       5

In [9]:
#Descriptive Statistics
#measures of dispersion
#variance and std deviation

# Measures of Dispersion

In [10]:
#variance
x=[1,1,2,2,3,3,4,5,5,6]
#using numpy
np.var(x)

2.7600000000000002

In [11]:
print("variance:",np.std(x))

variance: 1.661324772583615

In [12]:
#using pandas 
z.std()

values    1.75119
dtype: float64

In [13]:
#mean
import numpy as np
x=[1,1,2,2,3,3,4,5,5,6,100]
#using numpy 
np.mean(x)

12.0

In [14]:
#created the list in to a table format
import pandas as pd
z=pd.DataFrame(data={'values':[1,1,2,2,3,3,4,5,5,6,100]})
z

    values
0        1
1        1
2        2
3        2
4        3
5        3
6        4
7        5
8        5
9        6
10     100

In [15]:
#median
x=[1,1,2,2,3,3,4,5,5,6,100]
#using numpy
np.median(x)

3.0

In [16]:
print("median: ",np.median(x))

median:  3.0

In [ ]:
#mode
#numpy does not has an attribute mode

In [17]:
#using pandas
z.mode()

   values
0       1
1       2
2       3
3       5

In [18]:
#variance
x=[1,1,2,2,3,3,4,5,5,6,100]
#using numpy
np.var(x)

776.9090909090909

In [19]:
print("variance:",np.std(x))

variance: 27.873089009097843

In [20]:
#using pandas 
z.std()

values    29.233542
dtype: float64

In [21]:
#mean
import numpy as np
x=[1,1,2,2,3,3,4,5,5,6,100,112]
#using numpy 
np.mean(x)

20.333333333333332

In [22]:
#created the list in to a table format
import pandas as pd
z=pd.DataFrame(data={'values':[1,1,2,2,3,3,4,5,5,6,100,112]})
z

    values
0        1
1        1
2        2
3        2
4        3
5        3
6        4
7        5
8        5
9        6
10     100
11     112

In [23]:
#median
x=[1,1,2,2,3,3,4,5,5,6,100,112]
#using numpy
np.median(x)

3.5

In [ ]:
#mode
#numpy does not has an attribute mode

In [24]:
#using pandas
z.mode()

   values
0       1
1       2
2       3
3       5

In [25]:
#variance
x=[1,1,2,2,3,3,4,5,5,6,100,112]
#using numpy
np.var(x)

1476.0555555555557

In [ ]:
print("variance:",np.std(x))

In [26]:
#using pandas 
z.std()

values    40.127826
dtype: float64

In [27]:
#mean
import numpy as np
x=[1,2,2,3,4,5,6,6,6,7,8,100,200]
#using numpy 
np.mean(x)

26.923076923076923

In [28]:
#median
x=[1,2,2,3,4,5,6,6,6,7,8,100,200]
#using numpy
np.median(x)

6.0

In [ ]:
#mode
#numpy does not has an attribute mode

In [29]:
#using pandas
z.mode()

   values
0       1
1       2
2       3
3       5

In [30]:
#variance
x=[1,2,2,3,4,5,6,6,6,7,8,100,200]
#using numpy
np.var(x)

3142.84023668639

In [31]:
print("variance:",np.std(x))

variance: 56.0610402747433

In [32]:
#using pandas 
z.std()

values    40.127826
dtype: float64

In [33]:
#mean
import numpy as np
x=[1,2,2,3,4,5,6,6,6,7,8,100,200,5000]
#using numpy 
np.mean(x)

382.14285714285717

In [34]:
#median
x=[1,2,2,3,4,5,6,6,6,7,8,100,200,5000]
#using numpy
np.median(x)

6.0

In [ ]:
#mode
#numpy does not has an attribute mode

In [35]:
#using pandas
z.mode()

   values
0       1
1       2
2       3
3       5

In [ ]:
#variance
x=[1,2,2,3,4,5,6,6,6,7,8,100,200,5000]
#using numpy
np.var(x)

In [ ]:
print("variance:",np.std(x))

In [36]:
#using pandas 
z.std()

values    40.127826
dtype: float64

In [37]:
#mean
import numpy as np
x=[1,1,2,2,4]
#using numpy 
np.mean(x)

2.0

In [38]:
#median
x=[1,1,2,2,4]
#using numpy
np.median(x)

2.0

In [ ]:
#mode
#numpy does not has an attribute mode

In [39]:
#using pandas
z.mode()

   values
0       1
1       2
2       3
3       5

In [40]:
#variance
x=[1,1,2,2,4]
#using numpy
np.var(x)

1.2

In [ ]:
print("variance:",np.std(x))

In [41]:
#using pandas 
z.std()

values    40.127826
dtype: float64

In [42]:
#mean
import numpy as np
x=[2,2,2,2,2]
#using numpy 
np.mean(x)

2.0

In [43]:
#median
x=[2,2,2,2,2]
#using numpy
np.median(x)

2.0

In [ ]:
#mode
#numpy does not has an attribute mode

In [44]:
#using pandas
z.mode()

   values
0       1
1       2
2       3
3       5

In [45]:
#mean
import numpy as np
x=[2,2,2,2,2,10000]
#using numpy 
np.mean(x)

1668.3333333333333

In [46]:
#median
x=[2,2,2,2,2,10000]
#using numpy
np.median(x)

2.0

In [ ]:
#mode
#numpy does not has an attribute mode

In [47]:
#using pandas
z.mode()

   values
0       1
1       2
2       3
3       5